"""Messages texts."""

START_TEXT: str = """Приветствую, {}!
Я бот, который будет праворять практические задания по ЕГЭ.
Для выбора задания используйте /tasks и следуйте инструкциям.
Выбранное задание сохраняется между долгим отлучением от бота.
"""

CHOICE_SUBJECTS_TEXT: str = """Для начала выбирите предмет."""

CHOICE_NUMBER_TEXT: str = """Вы выбрали: {}
Теперь выбирите номер задания из ЕГЭ."""

CHOICE_TASK_TEXT_WRITE: str = """Вы выбрали {} предмет.
С номером задания {}.
Напишите в сообщения от 1 до {}.
Для выбора задания."""

CHOICE_TASK_TEXT: str = """Вы выбрали {} предмет.
С номером задания {}.
Выбирите задачу."""

ANSWER_QESTION_TEXT: str = """Вы выбрали {} предмет.
С номером задания {}.
И задачу {}
{}
"""
